snlkuharlocal/src/DataProcessors/КоличествоПосетителей/КоличествоПосетителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КоличествоПосетителей</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/КоличествоПосетителей/КоличествоПосетителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоПосетителей</name>
  <resources>
    <name>КоличествоПосетителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПосетителейЧЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодФизическогоУзла77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигатьДатуЗапрета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсииКонфигурации</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанкПК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПК</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоправочныйКоэффициентПоВходу</name>
    <comment>Среднее кол-во проходов одного сотрудника через счетчик (в день)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтароеПодразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПонедельно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйТипЦенРаспродажа</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастноеЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСтрокиВСертификате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаПечатиЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РазницаВоВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ведущее</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сейф</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАвтообмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаПродажаБлочками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорИнкассации</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СчастливыйПонедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЛимитИЗадолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуЗадолженностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфициальноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВыделенныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаИнкассации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаВидимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДКактивныДляРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКонтролироватьПодаркиПоСтоРублей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОКС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АкцияСтильнаяАрифметика</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксКассовыхДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АкцияСертификатыИзЧека</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцияПечататьТекстНаЧеке</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойКодСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АкцияСертификатыПластиковые</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСпасибоСбербанка</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАртикулаКонтрагента</name>
    <type>
      <types>CatalogRef.ТипыАтрикуловКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧасаДляМерчендайзинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьЦеныПРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НулеваяСтавкаНДСвЧеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцияПечатьКупонаНаСкидку</name>
    <type>
      <types>CatalogRef.Акции</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьСебестоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьТолькоСвоиСертификаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждениеОВидеОплатыПередПробитиемЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентФР</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЗаписейОТрудовойДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФИАС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяОбмена</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>НомерСчетчика</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КарточкаОбъекта</name>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДействияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительноеСоглашение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Индексация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>EnumRef.МесяцОплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтоПроверяемыеАкции</name>
    <attributes>
      <name>Акция</name>
      <type>
        <types>CatalogRef.Акции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/КоличествоПосетителей/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено)	   Экспорт
	
	ТабИД = Новый ТаблицаЗначений;
	ТабИД.Колонки.Добавить("ИД");
	ТабИД.Колонки.Добавить("Подразделение");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодразделенияСчетчики.НомерСчетчика КАК ИД,
	|	ПодразделенияСчетчики.ссылка КАК Подразделение
	|ИЗ
	|	Справочник.Подразделения.Счетчики КАК ПодразделенияСчетчики";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТабИД = ТабИД.Добавить();
		//крохин начало 16.04.2012
		//иногда вставляют лишние пробелы
		//СтрокаТабИД.ИД = Выборка.ИД;
		СтрокаТабИД.ИД = СокрЛП(Выборка.ИД);
		//крохин конец 16.04.2012
		СтрокаТабИД.Подразделение = Выборка.Подразделение;
	КонецЦикла;
	
	
	ТД = Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ИД");
	ТД.Колонки.Добавить("ДатаФайла");
	
	
	
	//ЗаписатьВЛог("Ватком",ТекущаяДата() - 3*24*60*60,"Информация"); 
	НачПериода = НачалоДня(ТекущаяДата() - 3*24*60*60);
	
	//ЗаписатьВЛог("Ватком",ТекущаяДата() - 24*60*60,"Информация"); 
	КонПериода =  КонецДня(ТекущаяДата() - 24*60*60);
	
	//Для переформирования данных о посетителях с начала месяца
	//НачПериода = НачалоМесяца(ТекущаяДата());
	//КонПериода = КонецМесяца(ТекущаяДата());
	
	
	
	//крохин начало 23.10.2020
	//FTP
	////нечаева 30.03.11 начало
	//// изменен путь по просьбе Жени Шипилова
	////ИмяКаталога = "\\Watcom\Export";
	//ИмяКаталога = "\\srvmail2\ftpfolders$\Watcom";
	////нечаева 30.03.11 конец
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПарольFTP = "*$*$*$";
	//ПользовательFTP="*%*%*%";
	ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPWatcom).Логин;
	ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPWatcom).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025

 СерверFTP="87.239.110.105";
 
 ПассивныйРежим = Ложь;
 
 МаскаФайлов =  "*.xml";
 

Соединение=УстановитьFTPСоединение(СерверFTP,ПользовательFTP,ПарольFTP,,ПассивныйРежим);
КаталогНаСервере = "";
	НайденныеФайлы = Соединение.НайтиФайлы(КаталогНаСервере, МаскаФайлов);

	//крохин конец 23.10.2020
	
	ТекстОшибок="";
	//кухарь 27.06.14 начало
	//проверка отсутствующих файликов
	СписокДат=новый СписокЗначений;	
	//кухарь 27.06.14 конец
	
	//крохин начало 23.10.2020
	//FTP
	//НайденныеФайлы = НайтиФайлы(ИмяКаталога,"*.xml");
	//крохин конец 23.10.2020
	Для Каждого Файлик из НайденныеФайлы Цикл
		Если Лев(Файлик.Имя,6)= "CM_SE_" Тогда 
			
			// новый формат файла
			
			Год =  Сред(Файлик.Имя,13,4);
			Месяц = Сред(Файлик.Имя,10,2);
			День = сред(Файлик.Имя,7,2);

			
			//ЗаписатьВЛог("Ватком","Дата """+Год+" - "+Месяц+" - "+День,"Информация");                     
			ДатаФайла = Дата(Год+Месяц+День);
			Если НачПериода <= ДатаФайла И ДатаФайла<= КонПериода тогда
				//кухарь 27.06.14 начало
				//проверка отсутствующих файликов				
				СписокДат.Добавить(ДатаФайла);
				//кухарь 27.06.14 конец
				
				//Сообщить(Файлик.ПолноеИмя);    //+++
				//Сообщить(ДатаФайла);
				
				ТЗ = Новый ТаблицаЗначений;
				ТЗ.Колонки.Добавить("ИД");
				ТЗ.Колонки.Добавить("Вход");
				ТЗ.Колонки.Добавить("Выход");
				ТЗ.Очистить();
				
				Файл = Новый ЧтениеXML;
				
				Попытка
					//крохин начало 23.10.2020
					//Файл.ОткрытьФайл(Файлик.ПолноеИмя);
					ИмяфайлаОбмена=КаталогВременныхФайлов()+"\in.mxl";
					КопироватьФайл3(Файлик.Имя,ИмяФайлаОбмена,Соединение,Ложь);
					Файл.ОткрытьФайл(ИмяФайлаОбмена);
					//крохин конец 23.10.2020
				Исключение
					
				КонецПопытки;
			
				
				Пока Файл.Прочитать() Цикл
					
					Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "ID_Enter" тогда
						файл.Прочитать(); 
						ИД = Файл.Значение;
					КонецЕсли; 
					
					Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "SumIn" тогда
						файл.Прочитать(); 
						Вход = Число(Файл.Значение);  // наименование номенклатуры
					КонецЕсли; 
					
					Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "SumOut" Тогда
						файл.Прочитать(); 
						
						Выход = Число(Файл.Значение);
						//ОбработкаПрерыванияПользователя();
						//состояние (строкатовара.номерстроки);
						
						// добавляем строку
						НовСтрока=ТЗ.Добавить();
						НовСтрока.ИД=Ид;
						НовСтрока.Вход=Вход;
						НовСтрока.Выход=Выход;
						
					КонецЕсли; 
					
				КонецЦикла;			
				
				// обрабатываем данные
				
				// обрабатываем данные
				ТЗ.Свернуть("ИД","Вход");
				
				// переименовываем по подр.
				Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
					
					Отбор = Новый Структура();
					Отбор.Вставить("ИД",СтрокаТЗ.ИД);
					СтрокиТабИД = ТабИД.НайтиСтроки(Отбор);
					Если СтрокиТабИД.Количество() > 0 Тогда
						Для Каждого СтрокаТабИД Из СтрокиТабИД Цикл
							
							ИД = СтрокаТабИД.Подразделение;
							СтрокаТЗ.ИД=ИД;
							прервать;
						КонецЦикла;
					Иначе
						ИД = Справочники.Подразделения.ПустаяСсылка();
						
					КонецЕсли;
					
				КонецЦикла;
				
				ТЗ.Свернуть("ИД","Вход");
				
				Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
					
					Ид=СтрокаТЗ.Ид;
					
					Если СтрокаТЗ.Вход <> 0 И  ИД <> Справочники.Подразделения.ПустаяСсылка() тогда
						//сообщить("ИД: "+ СтрокаТЗ.ИД+" -  "+Ид  + " Вход: " + СтрокаТЗ.Вход);
						ЗаписатьКоличествоПосетителей(ИД,СтрокаТЗ.Вход,КонецДня(ДатаФайла));
						//крохин начало
						СтрокаТД = Тд.Добавить();
						СтрокаТД.ИД = ИД;
						СтрокаТД.ДатаФайла = ДатаФайла;
						//крохин конец
					КонецЕсли;
					
				КонецЦикла;
				
				Файл.Закрыть();
				ТЗ.Очистить();
				
				
			КонецЕсли;
			
			
		Иначе //КонецЕсли;
			
			продолжить;  //++++
			
			// старый вариант
			Год =  Сред(Файлик.Имя,10,4);
			Месяц = Сред(Файлик.Имя,15,2);
			День = сред(Файлик.Имя,18,2);
			ДатаФайла = Дата(Год+Месяц+День);
			Если НачПериода <= ДатаФайла И ДатаФайла<= КонПериода тогда
				
				
				ТЗ = Новый ТаблицаЗначений;
				ТЗ.Колонки.Добавить("ИД");
				
				ТЗ.Колонки.Добавить("Вход");
				ТЗ.Колонки.Добавить("Выход");
				
				//Сообщить(2);
				//Сообщить(Файлик.ПолноеИмя);
				//Сообщить(ДатаФайла);
				Файл = Новый ЧтениеXML;
				Файл.ОткрытьФайл(Файлик.ПолноеИмя);
				
				Пока Файл.Прочитать() Цикл
					//	ОбработкаПрерыванияПользователя();
					Файл.Прочитать();
					Файл.Прочитать();
					Файл.Прочитать();
					
					ИД = Файл.Значение;
					Файл.Прочитать();
					Файл.Прочитать();
					Файл.Прочитать();
					попытка
						Вход = Число(Файл.Значение);
					исключение
						Вход = 0;
					КонецПопытки;
					Файл.Прочитать();
					Файл.Прочитать();
					Файл.Прочитать();
					попытка
						Выход = Число(Файл.Значение);
					исключение
						Выход = 0;
					КонецПопытки;
					
					Файл.Прочитать();
					Файл.Прочитать();
					Файл.Прочитать();
					Неизвестный = Файл.Значение;
					Файл.Прочитать();
					Файл.Прочитать();
					Файл.Прочитать();
					Дата = Файл.Значение;
					Файл.Прочитать();
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрокаТД = ТД.Добавить();
					
					Отбор = Новый Структура();
					Отбор.Вставить("ИД",ИД);
					СтрокиТабИД = ТабИД.НайтиСтроки(Отбор);
					Если СтрокиТабИД.Количество() > 0 Тогда
						Для Каждого СтрокаТабИД Из СтрокиТабИД Цикл
							
							ИД = СтрокаТабИД.Подразделение;
							прервать;
						КонецЦикла;
					Иначе
						ИД = Справочники.Подразделения.ПустаяСсылка();
						
					КонецЕсли;
					
					//Если ИД = "22817281" тогда
					//	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0010"); //GVZ
					
					//иначеесли  ИД = "52127918" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0009");  //WMR
					//иначеесли  ИД = "72677142" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0015");  //TRM
					
					//иначеесли  ИД = "101401560" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0004");  //SEM
					
					//иначеесли  ИД = "136563496" тогда
					//	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0011");  //GP4
					
					//иначеесли  ИД = "285444390" тогда
					//	  ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0016"); //AST
					
					//иначеесли  ИД = "554329575" тогда
					//	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0009");  //WMR
					
					//иначеесли  ИД = "596412102" тогда
					//	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0005");   //GP1
					
					//иначеесли  ИД = "800561952" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0004");  //SEM
					//иначеесли  ИД = "64089315" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0033");  //YAR
					//иначеесли  ИД = "331616610" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0072");  //ZVR
					//иначеесли  ИД = "594375558" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0057");  //KPK
					//иначеесли  ИД = "465053498" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0007");  //KPL
					//иначеесли  ИД = "8779536" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0058");  //KRP
					//иначеесли  ИД = "90390999" тогда
					// 	 ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0025");  //PRM
					//иначеесли  ИД = "97162846" тогда
					//	  ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0052");  //NCH
					//иначеесли  ИД = "464240465" тогда
					//	  ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0034");  //NNG
					//иначеесли  ИД = "487624753" тогда
					//	  ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0053");  //KZT
					// иначеесли  ИД = "99101184" тогда
					//	  ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0079");  //VGS
					// иначеесли  ИД = "671253388" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0043");  //OMM
					// иначеесли  ИД = "726737736" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0065");  //ISS
					// иначеесли  ИД = "170674506" тогда
					//	ИД =  Справочники.Подразделения.НайтиПоКоду("SSP-0040");  //MGN
					// иначеесли  ИД = "671253388" тогда
					//	ИД = Справочники.Подразделения.ПустаяСсылка();
					//КонецЕсли;
					
					
					
					НоваяСтрока.ИД = ИД;
					
					НоваяСтрока.Вход = Вход;
					НоваяСтрока.выход = Выход;
					
					НоваяСтрокаТД.ИД = строка(ИД);
					НоваяСтрокаТД.ДатаФайла = формат(ДатаФайла,"ДФ=dd.MM.yyyy");
				КонецЦикла;
				ТЗ.Свернуть("ИД","Вход,Выход");
				Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
					Если СтрокаТЗ.Вход <> 0 И СтрокаТЗ.ИД <> Справочники.Подразделения.ПустаяСсылка() тогда
						// сообщить("ИД: "+ СтрокаТЗ.ИД + " Вход: " + СтрокаТЗ.Вход);
						ЗаписатьКоличествоПосетителей(СтрокаТЗ.ИД,СтрокаТЗ.Вход,ДатаФайла);
					КонецЕсли;
					
					
				КонецЦикла;
				
				Файл.Закрыть();
				ТЗ.Очистить();
			Конецесли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	Текст = "";
	СтрокаТЦ = "";
	ДатаФайла = "";
	ТД.Свернуть("ДатаФайла,ИД","");
	Для Каждого СтрокаТД Из ТД Цикл
		Если ДатаФайла <> "" И ДатаФайла <> СтрокаТД.ДатаФайла Тогда
			Текст = Текст +Проверка(СтрокаТЦ,ДатаФайла);
			//крохин начало 13.09.2011
				//проверка корректности подразделения
//				СтрокаТЦ = СтрокаТД.ИД.Наименование;
			Если ТипЗнч(СтрокаТД.ИД) <> ТипЗнч(Справочники.Подразделения.ПустаяСсылка()) ИЛИ СтрокаТД.ИД = Справочники.Подразделения.ПустаяСсылка() Тогда
			Текст = Текст + " неверное подразделение  "+СтрокаТД.ИД +" за "+ДатаФайла + символы.ПС;	
			  СтрокаТЦ = СтрокаТД.ИД;
		    Иначе
			  СтрокаТЦ = СтрокаТД.ИД.Код;
			КонецЕсли;				
				//крохин конец 13.09.2011
			ДатаФайла = СтрокаТД.ДатаФайла; 
		иначе
						//крохин начало 13.09.2011
			//проверка корректности подразделения
			//СтрокаТЦ = СтрокаТЦ + СтрокаТД.ИД;	 //СтрокаТЦ = СтрокаТЦ + СтрокаТД.ИД.Наименование;
			Если ТипЗнч(СтрокаТД.ИД) <> ТипЗнч(Справочники.Подразделения.ПустаяСсылка()) ИЛИ СтрокаТД.ИД = Справочники.Подразделения.ПустаяСсылка() Тогда
			Текст = Текст + " неверное подразделение  "+СтрокаТД.ИД +" за "+ДатаФайла + символы.ПС;	
			СтрокаТЦ =   СтрокаТЦ + СтрокаТД.ИД;	
		Иначе
			СтрокаТЦ = СтрокаТЦ + СтрокаТД.ИД.Код;
			КонецЕсли;
				
				//крохин конец 13.09.2011

				
			ДатаФайла = СтрокаТД.ДатаФайла; 
			КонецЕсли;
	КонецЦикла;
	Текст = Текст +Проверка(СтрокаТЦ,ДатаФайла);
	//кухарь 27.06.14 начало
	//проверка отсутствующих файликов
	для сч=1 по 3 цикл
	день=СписокДат.НайтиПоЗначению(НачалоДня(ТекущаяДата() - Сч*24*60*60));
	если день=Неопределено тогда
		текст=текст+символы.ПС+"НЕТ ФАЙЛА ВЫГРУЗКИ ЗА "+лев(строка(НачалоДня(ТекущаяДата() - Сч*24*60*60)),10)+Символы.ПС; 
	КонецЕсли;
	КонецЦикла;
	//кухарь 27.06.14 конец
	
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		ПослатьПисьмо(Текст);
	КонецЕсли;
	
	
	
КонецПроцедуры //Загрузить


Процедура ЗаписатьКоличествоПосетителей(ИД,Вход,ДатаФайла) Экспорт	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ОтчетКассовойСмены.Ссылка  КАК Документ
	//|ИЗ
	//|	Документ.ОтчетКассовойСмены КАК ОтчетКассовойСмены
	//|ГДЕ
	//|	ОтчетКассовойСмены.ВидОплаты = &ВидОплаты
	//|	И ОтчетКассовойСмены.Проведен = Истина
	//|	И ОтчетКассовойСмены.Подразделение = &ИД
	//|	И ОтчетКассовойСмены.Дата МЕЖДУ &НачПериода И &КонПериода
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ОтчетКассовойСмены.Дата
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос.УстановитьПараметр("ИД",ИД);
	//Запрос.УстановитьПараметр("ВидОплаты",Перечисления.ВидыОплаты.НАЛ);
	//Запрос.УстановитьПараметр("НачПериода",НачалоДня(ДатаФайла));
	//Запрос.УстановитьПараметр("КонПериода",КонецДня(ДатаФайла));
	//выборка = Запрос.Выполнить().Выбрать();
	//Если выборка.Следующий() тогда
	//	
	//	ДокОбъект = выборка.Документ.ПолучитьОбъект();
	//	//	ДокОбъект = Документы.ОтчетКассовойСмены.СоздатьДокумент();
	//	ДокОбъект.КоличествоПосетителей = Вход;
	//	
	//	ЗаписатьВЛог("Ватком","Обраб. док-т - " + ДокОбъект + ". Количество посетителей = "+Вход+". Подразделение = "+ИД,"Информация");                     
	//	
	//	Попытка 
	//		ДокОбъект.Записать();
	//		Сообщить("Записан документ " + ДокОбъект + ". Количество посетителей = "+Вход+". Подразделение = "+ИД);
	//		ЗаписатьВЛог("Ватком","Записан документ " + ДокОбъект + ". Количество посетителей = "+Вход+". Подразделение = "+ИД,"Информация");                     
	//	Исключение
	//		ЗаписатьВЛог("Ватком",""+ОписаниеОшибки()+ " Документ: "+ ДокОбъект,"Информация");                     
	//		Сообщить(ОписаниеОшибки()+ " Документ: "+ ДокОбъект);
	//	КонецПопытки;
	//	
	//иначе
	//	ЗаписатьВЛог("Ватком","За "+ДатаФайла + "нет проведенных документов ОКС "+ИД,"Информация"); 
	//	
	//	Сообщить("За "+ДатаФайла + "нет проведенных документов ОКС");
	//конецесли;
	
	
	//конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетКассовойСмены.Ссылка  КАК Документ
	|ИЗ
	|	Документ.ОтчетКассовойСмены КАК ОтчетКассовойСмены
	|ГДЕ
	|	ОтчетКассовойСмены.ВидОплаты = &ВидОплаты
	|	И ОтчетКассовойСмены.Проведен = Истина
	|	И ОтчетКассовойСмены.Подразделение = &ИД
	|	И ОтчетКассовойСмены.Дата МЕЖДУ &НачПериода И &КонПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКассовойСмены.Дата
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ИД",ИД);
	Запрос.УстановитьПараметр("ВидОплаты",Перечисления.ВидыОплаты.НАЛ);
	//крохин начало 13.09.2011
	//для случая, когда нет ОКС за день загрузки
	//Запрос.УстановитьПараметр("НачПериода",НачалоДня(ДатаФайла));
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ДатаФайла)-14*24*60*60);
	//крохин конец 13.09.2011
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ДатаФайла));
	выборка = Запрос.Выполнить().Выбрать();
	
	ДокОбъект=Неопределено;
	Склад=Неопределено;
	Если выборка.Следующий() тогда
		
		ДокОбъект = выборка.Документ.ПолучитьОбъект();
		//	ДокОбъект = Документы.ОтчетКассовойСмены.СоздатьДокумент();
		ДокОбъект.КоличествоПосетителей = Вход;
		Склад=ДокОбъект.Склад;
	КонецЕсли;	
    	
	
	// стало - запись в регистр сведений
		//крохин начало 13.09.2011
	//пишем в регистр только верные сообщения
	Если Склад = Неопределено ИЛИ ТипЗнч(ИД) <> ТипЗнч(Справочники.Подразделения.ПустаяСсылка()) ИЛИ ИД = Справочники.Подразделения.ПустаяСсылка() Тогда
	 Иначе
	//крохин конец 13.09.2011

	НаборЗаписей = РегистрыСведений.КоличествоПосетителей.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.Дата.Установить(НачалоДня(ДатаФайла)); 
	НаборЗаписей.Отбор.Подразделение.Установить(Ид); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Дата = НачалоДня(ДатаФайла); 
	НоваяЗапись.Подразделение = Ид; 
	НоваяЗапись.Склад = Склад; 
	НоваяЗапись.КоличествоПосетителей = Вход; 
	
//	НаборЗаписей.Записать(); 
	
		
	Попытка 
		НаборЗаписей.Записать(); 
		//ЗаписатьВЛог("Ватком","Записано количество посетителей = "+Вход+". Подразделение = "+ИД,"Информация");                     
	Исключение
		ЗаписатьВЛог("Ватком",""+ОписаниеОшибки(),"Информация");                     
	КонецПопытки;
		//крохин начало 13.09.2011
	//пишем в регистр только верные сообщения
	
		КонецЕсли;
   	//крохин конец 13.09.2011	
	
КонецПроцедуры

Процедура ПослатьПисьмо(Текст) Экспорт
	
	//возврат; //+++
	
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("Ватком","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	//крохин 19.01.2016
	//Сообщение.Получатели.Добавить("loban@collant.ru");
	//крохин конец 19.01.2016
	Сообщение.Получатели.Добавить("helpdesk@collant.ru");
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//крохин начало 28.01.2015
	//Сообщение.Получатели.Добавить("grishakov@collant.ru");
	//крохин конец 28.01.2015
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	//крохин начало 28.01.2015
	//	Сообщение.Получатели.Добавить("melnik@collant.ru");
	//крохин конец 28.01.2015	
		Сообщение.Получатели.Добавить("krohin@collant.ru");
	//крохин начало 28.01.2015
	//Сообщение.Копии.Добавить("shipilov@collant.ru");
	//крохин конец 28.01.2015
	//крохин начало 24.03.2015
	//	Сообщение.Копии.Добавить("yshipilov@collant.ru");
	  Сообщение.Копии.Добавить("cher@collant.ru");	  
	  Сообщение.Копии.Добавить("filippov@collant.ru");	  
	  
		
	//Кухарь 08.05.18 начало
	  Сообщение.Копии.Добавить("ryabchenko@collant.ru");	  	
	//Кухарь 08.05.18 конец	
  
	//крохин конец 24.03.2015	
	Сообщение.Получатели.Добавить("pokidyshev@collant.ru");	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = "Загрузка количества посетителей. Ватком.";
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	

//крохин начало 22.07.2020
//Функция Проверка(СтрокаТЦ,ДатаФайла) Экспорт
Функция Проверка(СтрокаТЦ,ДатаФайла, Подразделение = Неопределено) Экспорт
//крохин конец 22.07.2020	
	Если ДатаФайла = "" или ДатаФайла=0 Тогда
		возврат "";
	КонецЕсли;
	
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодразделенияСчетчики.Ссылка
	|ИЗ
	|	Справочник.Подразделения.Счетчики КАК ПодразделенияСчетчики";
	//крохин начало 22.07.2020
	Если Подразделение <> Неопределено Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПодразделенияСчетчики.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Подразделения.Счетчики КАК ПодразделенияСчетчики
	               |ГДЕ
	               |	ПодразделенияСчетчики.Ссылка = &Подразделение";	
   КонецЕсли;
Запрос.УстановитьПараметр("Подразделение",Подразделение);
	//крохин конец 22.07.2020
	
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//крохин начало 13.09.2011
		//проверка по коду
	//	Если НЕ Найти(СтрокаТЦ,Выборка.Ссылка.Наименование) Тогда
	Если НЕ Найти(СтрокаТЦ,Выборка.Ссылка.Код) Тогда
		//крохин конец 13.09.2011
			ТекстОшибки = ТекстОшибки + " нет "+Выборка.Ссылка.наименование +" за "+ДатаФайла + символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если НЕ Найти(СтрокаТЦ,"АСТ") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет АСТ за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Вэймарт") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Вэймарта за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Семеновский") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Семеновского за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Гвоздь") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Гвоздя за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Лига") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Лиги за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Триумфальный") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Триумфального за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Ярославль") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Ярославля за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Золотой Вавилон") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Золотого Вавилона за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Капитолий на Каширке") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Капитолия на Каширке за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Капитолий на Ленинградке") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Капитолия на Ленинградке за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Красноярск - Планета") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Красноярска - Планета за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Пермь") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Перми за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Набережные Челны") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Набережных Челнов за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Нижний Новгород") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Нижниго Новгорода за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Казань-Тандем") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Казань-Тандема за "+ДатаФайла;
	//КонецЕсли;
	//Если НЕ Найти(СтрокаТЦ,"Вегас-Каширка") Тогда
	//	ТекстОшибки = ТекстОшибки + " Нет Вегаса-Каширка за "+ДатаФайла;
	//КонецЕсли;
	Возврат ТекстОшибки;
КонецФункции

//крохин начало 23.10.2020
функция КопироватьФайл3(ИмяФайлаИсточника,ИмяФайлаПриемника,СоединениеFTP=Неопределено,НаFTP=Истина)
	Если СоединениеFTP=Неопределено тогда
	Копироватьфайл(ИмяФайлаИсточника,ИмяФайлаПриемника);
	иначе
	ИмяФайлаПриемника1=СтрЗаменить(ИмяФайлаПриемника,"\","/");
	ИмяФайлаИсточника1=СтрЗаменить(ИмяФайлаИсточника,"\","/");
	Если НаFTP тогда
	СоединениеFTP.Записать(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	иначе
	СоединениеFTP.Получить(ИмяФайлаИсточника1,ИмяФайлаПриемника1);
	Конецесли;
	Конецесли;
Конецфункции
//крохин конец 23.10.2020
